# Exercise

What follows are several exercises regarding aggregation and grouping in pandas.

In this exercise, you will work with a fictional dataset containing sales data for a retail store. The dataset is provided in CSV format and consists of the following columns:

1. Employee_ID: Unique identifier for each employee (Integer).
2. Department: Department where the employee works (Categorical - String).
3. Gender: Gender of the employee (Categorical - String).
4. Age: Age of the employee (Integer).
5. Years_of_Experience: Number of years of experience of the employee (Integer).
6. Performance_Rating: Performance rating of the employee (Float, scale of 1 to 5).
Your task is to use pandas to perform various data analysis tasks and derive insights from the dataset.

In [1]:
import pandas as pd

# Create the first dataset
data1 = {
    'ID': [1, 2, 3],
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 35]
}
df1 = pd.DataFrame(data1)

# Create the second dataset
data2 = {
    'ID': [4, 5, 6],
    'Name': ['David', 'Eva', 'Frank'],
    'Age': [40, 45, 50]
}
df2 = pd.DataFrame(data2)

data3 = {
    'Salary': [50000, 60000, 70000],
    'Position': ['Manager', 'Developer', 'Analyst']
}
df3 = pd.DataFrame(data3)

### 1. Concatenate Two Datasets Vertically

- Concatenate df1 and df2 vertically (along rows) to create a single DataFrame.
- Ensure the resulting DataFrame has unique index values.
- Display the concatenated DataFrame.

In [4]:
df1

   ID     Name  Age
0   1    Alice   25
1   2      Bob   30
2   3  Charlie   35

In [13]:
pd.concat([df1 , df2], ignore_index=True)

   ID     Name  Age
0   1    Alice   25
1   2      Bob   30
2   3  Charlie   35
3   4    David   40
4   5      Eva   45
5   6    Frank   50

### 2. Concatenate Two Datasets Horizontally

- Concatenate df1 and df2 horizontally (along columns) to create a single DataFrame.
- Ensure the resulting DataFrame has unique index values.
- Display the concatenated DataFrame.

In [12]:
pd.concat([df1,df2],axis=1)

   ID     Name  Age  ID   Name  Age
0   1    Alice   25   4  David   40
1   2      Bob   30   5    Eva   45
2   3  Charlie   35   6  Frank   50

### 3. Concatenate Two Datasets with Different Columns

- Create a new DataFrame df3 with additional columns.
- Concatenate df1 and df3 horizontally.
- Fill missing values in the resulting DataFrame with appropriate values.
- Display the concatenated DataFrame.

In [14]:
pd.concat([df1,df3], axis=1)

   ID     Name  Age  Salary   Position
0   1    Alice   25   50000    Manager
1   2      Bob   30   60000  Developer
2   3  Charlie   35   70000    Analyst